{
    "easy": [
      "What sparked your interest in exploring how AI impacts honesty in education?",
      "How would you explain, in simple terms, how tools like ChatGPT are used in schools?",
      "What are the main concerns about depending too much on AI in educational settings?",
      "How do you define plagiarism when it comes to content generated by AI?",
      "How do standard plagiarism detectors help prevent cheating using AI?",
      "How has modern technology changed the way students plagiarize, according to your study?",
      "What is one major ethical issue with using AI in education that you highlight?",
      "Why might students choose to use AI tools for their assignments?",
      "How does using AI in the classroom affect student creativity?",
      "What does the term 'cognitive reserve' mean and why is it important in your research?",
      "How do AI detection tools work based on what you found in your research?",
      "What are some drawbacks of using AI for completing assignments?",
      "How can educators reduce the negative effects of overusing AI?",
      "Why is critical thinking so important in your study?",
      "How do you suggest balancing the benefits and drawbacks of AI in education?"
    ],
    "medium": [
      "How did existing research influence your view on AI's effect on academic honesty?",
      "Can you explain what 'cognitive offloading' is and why it matters for learning?",
      "How might AI detectors sometimes give wrong results, like false positives or negatives?",
      "What steps can be taken to prevent misuse of AI for generating academic work?",
      "How does your research tackle the ethical issues that arise when students use AI to cheat?",
      "What are the limitations of current plagiarism detectors when it comes to AI-created content?",
      "How can institutions adjust policies to include AI without lowering academic standards?",
      "What impact does AI's tendency to produce 'hallucinations' have on the reliability of its answers?",
      "What long-term effects might occur if students stop thinking critically because they rely on AI?",
      "How can digital literacy help minimize the risks associated with using AI in education?",
      "How do you balance the benefits of AI with its risks to academic integrity?",
      "What role do deadlines and competition play in why students use AI?",
      "How are non-native English speakers affected by biases in AI detection tools?",
      "Can you describe the relationship between human critical thinking and AI-generated content?",
      "How does your work help in developing better methods to detect AI-generated work?"
    ],
    "hard": [
      "In what ways does your research show that current education is challenged by AI tools?",
      "How do the cognitive and ethical effects of using AI compare in traditional versus digital classrooms?",
      "Can you assess how well current AI detectors distinguish between human-written and AI-generated text?",
      "How does your thesis combine theory and data to explore AI's effect on student independence?",
      "What new strategies do you propose to improve academic honesty in the era of AI?",
      "How do the pros and cons of AI appear in modern education, based on your findings?",
      "What policy changes does your study suggest for higher education?",
      "How can future AI advancements be used to support, rather than weaken, critical thinking?",
      "What long-term social impacts might result from widespread AI use in education?",
      "How does your research balance AI's quick answers with the need for deep, reflective learning?",
      "What challenges did you face when researching AI’s role in academic dishonesty?",
      "How do you envision the evolution of AI detection systems to overcome current limits?",
      "What ethical principles form the basis of your recommendations for using AI in education?",
      "Can you compare the impact of AI on cognitive reserve with its ability to offer personalized learning?",
      "What are the most critical future research directions at the intersection of AI and education, and how does your work contribute?"
    ]
  }
  